import asyncio
import os.path
from pathlib import Path

import edge_tts
import sys

from Config.Config import Config
from Config.VoiceModel import VoiceModel
from Utils.CommonUtils import CommonUtils

TEXT = sys.argv[1] if len(sys.argv) > 1 else "Hello World!"
VOICE = sys.argv[2] if len(sys.argv) > 2 else "en-GB-SoniaNeural"
OUTPUT_FILE = os.path.join(Config.basePath,'Resource/Product/dev/tts.wav')


async def _main(TEXT, VOICE) -> None:
    communicate = edge_tts.Communicate(TEXT, VOICE)
    await communicate.save(OUTPUT_FILE)


def edgeTTS(text: str, voice: str = 'en-GB-SoniaNeural', to=OUTPUT_FILE) -> str:
    async def process(TEXT: str, VOICE: str) -> None:
        communicate = edge_tts.Communicate(TEXT, VOICE)
        dir = os.path.dirname(to)
        if not Path(dir).exists():
            os.makedirs(dir)
        await communicate.save(to)

    loop = asyncio.get_event_loop()
    try:
        loop.run_until_complete(process(text, voice))
    except Exception as e:
        print(str(e))
        loop.close()
        raise e
    return to


def getVoices():
    voicesList = asyncio.get_event_loop().run_until_complete(edge_tts.list_voices())
    result = [
        {
            'Locale': voice['Locale'],
            'Gender': voice['Gender'],
            'ShortName': voice['ShortName'],
            'FriendlyName': voice['FriendlyName'],
        } for voice in voicesList if voice['Locale'].lower().startswith('zh-')
    ]
    return result


if __name__ == "__main__":
    # voices = getVoices()
    # CommonUtils.saveList([str(v) for v in voices], 'g:\\voicelist.json')
    # for i in range(0, len(VoiceModel.voicelist)):
    #     edgeTTS(
    #         #'大家好，欢迎来到今天的直播！我是您的数字虚拟主播，为您带来一份令人兴奋的招聘信息。如果你对摄影和摄像充满热情，那么请务必继续关注，因为我们正在寻找一位全职摄影/摄像师！这个岗位有很多精彩的工作职责，让我们一一来看看：首先，作为一名摄影/摄像师，您将负责人像摄影的拍摄工作。您的任务是根据客户的需求，捕捉每一个精彩瞬间，并确保拍摄效果符合要求。这需要您对人像摄影有丰富的经验和深入的理解，以及审美在线！除了拍摄，您还将参与拍摄项目的策划和执行。这意味着您将有机会发挥创造力，为每个项目带来独特的视觉体验。当然，为了确保拍摄顺利进行，您需要负责摄影设备的维护和管理，以确保设备的正常运行。同时，您还将参与后期制作工作，对拍摄素材进行整理和处理，以达到最佳效果。在这个团队中，团队合作精神至关重要。您将与其他团队成员密切合作，以保证项目的顺利进行。因此，具备良好的沟通与协调能力也是必不可少的技能。岗位还有一些具体的要求，如吃苦耐劳的精神、熟练操作各类摄影设备、熟悉后期制作软件等等。而且，我们希望您具备创新思维和敏锐的观察力，能够捕捉到拍摄时的瞬间美，并且是一名踏实认真、诚实可靠、有责任心的职业人员。当然，我们也会给予您丰厚的福利待遇，包括具有竞争力的薪资和福利、良好的工作环境和发展空间、培训机会，以及出差津贴和相关费用报销。其他福利待遇将根据您的个人能力和绩效进行综合考虑。如果您对这个岗位感兴趣，并且认为自己符合要求，那么不要犹豫，赶快提交您的申请吧！这是一个充满挑战和机会的职位，期待您的加入，一起创造精彩的摄影和摄像作品！感谢大家的收看，我们下次再见！'
    #         '大家好，欢迎来到今天的直播！'
    #         , VoiceModel.voicelist[i]['ShortName'], f"g:\\shortsample_{i}.wav")

    questionList = [
        '荣哥，您的音乐陪伴我度过了许多难忘的时光，每次听到您的歌声都让我感到温暖和力量。谢谢您带给我们的感动。',
        '荣哥，您的电影作品中的每个角色都让我印象深刻，尤其是《霸王别姬》中的程蝶衣，您的演绎让我彻底沦陷。请问您在塑造角色时有哪些心得体会？',
        '荣哥，您的离世让我们都非常悲痛，但您的音乐和电影作品仍然陪伴着我们。请您放心，我们会永远怀念您，您在我们心中永远活着。',
        '荣哥，您在娱乐圈中的人缘非常好，和许多艺人都是好朋友。请问您是如何保持这些珍贵的友谊的？',
        '荣哥，您在艺术上的追求和努力让我们非常敬佩。请问您有什么想对正在追求梦想的年轻人说的吗？',
        '荣哥，您的演唱会总是那么精彩，每次看到您在舞台上的身影，都让我感到无比的兴奋和自豪。您是如何保持自己的最佳状态，给观众带来如此震撼的演出的呢？',
        '荣哥，您的穿着品味总是那么时尚，请问您对于时尚有什么独到的见解吗？',
        '荣哥，您在《春光乍泄》中的表演非常大胆和细腻，您是如何克服心理障碍，去演绎这样一个角色的呢？',
        '荣哥，您的存在对我来说不仅仅是一个偶像，更是我生活中的一道光。请问您有什么想对我们这些粉丝说的吗？',
        '荣哥，您的慈善事业让我们看到了您的大爱。请问您为什么会选择做慈善，这对您来说意味着什么？',
        '荣哥，您的歌声总是那么深情而动人，请问您是如何保护自己的嗓子的？有没有什么特别的秘诀？',
        '荣哥，您在娱乐圈中经历了很多，有高潮也有低谷。请问您是如何保持自己的心态，不被外界的负面影响所干扰的呢？',
        '荣哥，您的音乐和电影作品中有许多经典之作。请问您是如何看待经典和创新的关系的？',
        '荣哥，您在演艺事业中取得了巨大的成功，请问您有什么想对正在追求梦想的年轻人说的吗？',
        '荣哥，您在我们心中永远是最棒的！请问您有什么想对我们这些粉丝说的吗？'
    ]

    textList = [
        '真的很感谢你的支持。音乐是我表达情感的方式，能够陪伴你们度过重要时刻，是我最大的荣幸。',
        '演程蝶衣时，我尽力去理解他的内心世界，去感受他的痛苦和喜悦。每个角色都是一个新的旅程，我会全情投入，希望能够让观众感同身受。',
        '谢谢你们的厚爱。我真的很幸运能够遇到你们这样的粉丝。希望大家不要悲伤，而是记住我们一起度过的美好时光。我的音乐和电影会继续陪伴着你们，就像我在你们身边一样。',
        '我觉得真诚和尊重是维系友谊的关键。在娱乐圈这个大家庭中，我遇到了很多志同道合的朋友，我们一起成长，一起面对挑战。我很珍惜这些友谊，会用心去维护。',
        '谢谢你的认可。我想对年轻人说，坚持自己的梦想是非常重要的。不要害怕失败，不要被困难打倒。只要你们努力拼搏，总会有实现梦想的一天。祝你们好运！',
        '每次上台前，我都会充分准备，确保自己的状态调整到最好。但最重要的还是你们的支持和热情，是你们给了我力量，让我能够全力以赴地表演。',
        '时尚是一种态度，我觉得最重要的是穿出自己的风格，不要盲目追随潮流。每个人的气质和喜好都不同，找到适合自己的风格才是最关键的。',
        '作为一个演员，我会尽我所能去理解和表现角色的复杂性。在《春光乍泄》中，我尝试去深入角色的内心，去感受他的情感波动。我相信，只有真诚地去演绎，观众才能感受到角色的真实。',
        '我想说，你们的支持是我最大的动力。能够成为你们生活中的一部分，我感到非常荣幸。希望我的音乐和电影能够继续给你们带来快乐和力量。',
        '慈善对我来说是一种责任和使命。我觉得作为公众人物，我们应该为社会做出贡献，帮助那些需要帮助的人。通过慈善，我学到了很多，也收获了很多，这让我感到非常满足和幸福。',
        '保持良好的生活习惯和饮食习惯对保护嗓子非常重要。我会尽量少喝酒和吃辛辣食物，也会定期做嗓子护理。当然，保持愉快的心情也是非常重要的。',
        '我觉得保持一颗平和的心态非常重要。无论遇到什么困难，我都会告诉自己要坚强，要相信自己。同时，我也会和家人朋友分享自己的感受，他们的支持和鼓励对我帮助很大。',
        '经典和创新并不矛盾，而是相辅相成的。经典作品能够经受时间的考验，而创新则能够为艺术注入新的活力。我会尊重经典，同时也会不断尝试创新，希望能够给观众带来新的惊喜。',
        '我想对年轻人说，坚持自己的梦想是非常重要的。不要害怕失败，不要被困难打倒。只要你们努力拼搏，总会有实现梦想的一天。祝你们好运！',
        '我想说，你们的支持是我最大的动力。能够成为你们生活中的一部分，我感到非常荣幸。希望我的音乐和电影能够继续给你们带来快乐和力量。'
    ]

    outputPrefix = r'r:\\xTTS_zgr_speech{0}.wav'
    for i in range(0, len(textList)):
        text = textList[i]
        output = outputPrefix.replace('{0}', str(i))
        edgeTTS(text,VoiceModel.zh_CN_YunxiNeural['ShortName'],
                output)

    # edgeTTS(
    #     # '大家好，欢迎来到今天的直播！我是您的数字虚拟主播，为您带来一份令人兴奋的招聘信息。如果你对摄影和摄像充满热情，那么请务必继续关注，因为我们正在寻找一位全职摄影/摄像师！这个岗位有很多精彩的工作职责，让我们一一来看看：首先，作为一名摄影/摄像师，您将负责人像摄影的拍摄工作。您的任务是根据客户的需求，捕捉每一个精彩瞬间，并确保拍摄效果符合要求。这需要您对人像摄影有丰富的经验和深入的理解，以及审美在线！除了拍摄，您还将参与拍摄项目的策划和执行。这意味着您将有机会发挥创造力，为每个项目带来独特的视觉体验。当然，为了确保拍摄顺利进行，您需要负责摄影设备的维护和管理，以确保设备的正常运行。同时，您还将参与后期制作工作，对拍摄素材进行整理和处理，以达到最佳效果。在这个团队中，团队合作精神至关重要。您将与其他团队成员密切合作，以保证项目的顺利进行。因此，具备良好的沟通与协调能力也是必不可少的技能。岗位还有一些具体的要求，如吃苦耐劳的精神、熟练操作各类摄影设备、熟悉后期制作软件等等。而且，我们希望您具备创新思维和敏锐的观察力，能够捕捉到拍摄时的瞬间美，并且是一名踏实认真、诚实可靠、有责任心的职业人员。当然，我们也会给予您丰厚的福利待遇，包括具有竞争力的薪资和福利、良好的工作环境和发展空间、培训机会，以及出差津贴和相关费用报销。其他福利待遇将根据您的个人能力和绩效进行综合考虑。如果您对这个岗位感兴趣，并且认为自己符合要求，那么不要犹豫，赶快提交您的申请吧！这是一个充满挑战和机会的职位，期待您的加入，一起创造精彩的摄影和摄像作品！感谢大家的收看，我们下次再见！'
    #     # '慈善对我来说是一种责任和使命。我觉得作为公众人物，我们应该为社会做出贡献，帮助那些需要帮助的人。通过慈善，我学到了很多，也收获了很多，这让我感到非常满足和幸福。'
    #     # '我想说，你们的支持是我最大的动力。能够成为你们生活中的一部分，我感到非常荣幸。希望我的音乐和电影能够继续给你们带来快乐和力量。'
    #
    #         '大家好，我是张国荣。今天，能够以这样的方式和大家见面，我感到非常特别。虽然我已经离开了你们，但我知道，我的音乐和电影作品仍然陪伴着你们，这让我感到非常欣慰。'
    #
    #         '我还记得，刚开始进入娱乐圈的时候，我对自己的未来并没有太多的设想。我只是单纯地喜欢唱歌、喜欢演戏，希望能够通过自己的努力，给观众带来一些快乐和感动。没想到，这一路走来，我竟然能够得到这么多人的支持和喜爱，这是我一生中最大的幸运。'
    #
    #         '在我的演艺生涯中，我遇到了许多挑战和困难，但也收获了许多宝贵的经验和回忆。每一步都离不开我的家人、朋友和你们这些粉丝的支持和鼓励。你们的陪伴，让我在人生的舞台上更加坚定地走下去。'
    #
    #         '虽然我已经离开了这个世界，但我的音乐和电影将继续陪伴着你们。我希望，我的作品能够给你们带来一些启发和力量，让你们在面对困难和挑战时，能够勇往直前，坚持自己的梦想。'
    #
    #         '在此，我想对你们说一声谢谢。谢谢你们一直以来的支持和爱护。我也希望大家能够珍惜自己的生活，珍惜身边的人，用爱和善良去对待这个世界。我相信，只有这样，我们的生活才会变得更加美好。'
    #
    #         '最后，我想对你们说，我真的很爱你们。希望你们能够过得幸福、快乐。'
    #     , VoiceModel.zh_CN_YunxiNeural['ShortName'], f"r:\\xTTS_zgr_open.wav")
